// Завдання 1:
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так - виведіть повідомлення 'Вірно' у alert().
//    Якщо ні - виведіть 'Невірно'.

// let number = prompt('Введіть число 10');
// if (Number(number) === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// Завдання 2:
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);
// function quarterOfHour(min) {
//   if (min >= 0 && min < 15) {
//     return alert(`${min} входить в першу чверть`);
//   } else if (min >= 15 && min < 30) {
//     return alert(`${min} входить в другу чверть`);
//   } else if (min >= 30 && min < 45) {
//     return alert(`${min} входить в третю чверть`);
//   } else if (min >= 45 && min <= 59) {
//     return alert(`${min} входить в четверту чверть`);
//   }
// }
// quarterOfHour(min);

// Завдання 3:
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const value = prompt('введіть значення від 1 до 4');
// let result = '';
// switch (Number(value)) {
//   case 1:
//     alert('зима');
//     break;
//   case 2:
//     alert('весна');
//     break;
//   case 3:
//     alert('літо');
//     break;
//   case 4:
//     alert('осінь');
//     break;
//   default:
//     alert('Вибачте, але ви маєте ввести значення від 1 до 4 включно');

//     break;
// }

// Завдання 4:
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// let minutes = prompt('Вкажіть кількість хвилин');
// const getTime = minutes => {
//   const hours = Math.floor(minutes / 60);
//   const mins = minutes % 60;
//   return `${String(hours).padStart(2, '0')}:${String(mins).padStart(2, '0')}`;
// };
// console.log(getTime(minutes));

// Завдання 5:
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// let login = prompt('Введіть логін');
// console.log(login);

// if (login === 'admin') {
//   let password = prompt('Введіть пароль');
//   if (password === 'admin') {
//     alert('Hello');
//   } else {
//     alert('Wrong password!');
//   }
// } else if (login === '') {
//   alert('Скасовано!');
// } else {
//   alert('Я вас не знаю');
// }

// Завдання 6:
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let number = 0;
// while (number <= 20) {
//   console.log(number);
//   number += 1;
// }

// Завдання 7:
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.
// let min = prompt('min');
// let max = prompt('max');
// const getNumbers = (min, max) => {
//   let number = max;
//   let sum = 0;
//   while (number >= min) {
//     console.log(number);
//     number -= 1;
//     if (number % 2 === 0) {
//       sum += number;
//     }
//   }
//   console.log(sum);
//   return sum;
// };
// getNumbers(min, max);

// Завдання 8:
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// let a = Number(prompt('a'));
// console.log('🚀 ~ a:', a);
// let b = Number(prompt('b'));
// console.log('🚀 ~ b:', b);

// const min = (a, b) => {
//   if (
//     typeof a !== 'number' ||
//     typeof b !== 'number' ||
//     Number.isNaN(a) ||
//     Number.isNaN(b)
//   ) {
//     return 'Not a number';
//   }
//   if (a > b) {
//     console.log(b);
//   } else {
//     console.log(a);
//   }
// };

// min(a, b);

// Завдання 9:
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// let age = Number(prompt('your age is?'));

// const isAdult = age => {
//   let confirmation;
//   if (age >= 18) {
//     confirmation = true;
//     alert('very well');
//   } else {
//     confirmation = false;
//     alert('too young');
//     return 'Are you sure you are allowed?';
//   }
// };

// const result = isAdult(age);
// console.log(result);

// Завдання 10:
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// let value = 0;
// let num = prompt('enter the number');
// const fizzBuzz = num => {
//   while (value < num) {
//     value += 1;
//     if (value % 3 === 0 && value % 5 === 0) {
//       console.log('fizzbuzz');
//     } else if (value % 5 === 0) {
//       console.log('buzz');
//     } else if (value % 3 === 0) {
//       console.log('fizz');
//     } else {
//       console.log(value);
//     }
//   }
// };

// const result = fizzBuzz(num);
// console.log(result);
